
"""
    Здесь объявляются общие трактовки взависимости от положения планет
"""

prav_1house_in_1house = ['величиственная внешность', 'здоровое тело', 'сильный иммунитет']
prav_1house_in_2house = ['cтремление к выгоде', 'много знаний', 'добродеятельность', 'религиозность']
prav_1house_in_3house = ['склонность к экономии', 'бережливость', 'практичность', 'способности в экономике',
                         'способность предвидеть', 'наблюдательность', 'проницательность', 'способность понимать законы',
                         'инициативность', 'храбрость', 'прожорливость', 'сильные физические данные',
                         'благородство, много знаний']
prav_1house_in_4house = ['раздражительность','похотливость','забота о своем теле','украшение своего тела']
prav_1house_in_5house = ['благородность']









