import numpy as np
from matplotlib import cm, colors

SURIA_SIDDHANTA_AINAMSHA = 4140

def get_color_scheme(n, base_color=None):
    result = []
    chet = (n/2) != int(n/2)
    itr_ = n - 6 - chet
    if base_color == 'green':
        colors_class = {'red': np.linspace(.95, 0, itr_).tolist(),
                        'green': np.linspace(.95, .7, itr_).tolist(),
                        'blue': np.linspace(.95, 0, itr_).tolist()}

    elif base_color == 'red':
        colors_class = {'green': np.linspace(.95, 0, itr_).tolist(),
                        'red': np.linspace(.9, .6, itr_).tolist(),
                        'blue': np.linspace(.95, 0, itr_).tolist()}
    else:
        colors_class = {}

    for mm in np.arange(itr_):
        r = colors_class['red'][mm]
        g = colors_class['green'][mm]
        b = colors_class['blue'][mm]
        result.append(colors.to_hex([r, g, b]))

    # sh_result = np.array(result).reshape(2,-1)
    # result = np.array(sh_result[1].tolist() + sh_result[1].tolist()).reshape(2,-1).T.reshape(-1).tolist()
    pre_result = []
    for m in np.arange(n-itr_):
        pre_result += ['#ffffff']
    result = pre_result + result

    return result

NUMBER_OF_PLANETS = 9
NUMBER_OF_GRAHAS = 7
NUMBER_OF_ZNAKS = 12
GRAHAS_RANGE = np.arange(NUMBER_OF_GRAHAS)

SUN_PLANET_NUMBER = 0
MOON_PLANET_NUMBER = 1
MARS_PLANET_NUMBER = 2
MERCURY_PLANET_NUMBER = 3
JUPITER_PLANET_NUMBER = 4
VENUS_PLANET_NUMBER = 5
SATURN_PLANET_NUMBER = 6
RAHY_PLANET_NUMBER = 7
KETY_PLANET_NUMBER = 8
AIANAMSHA = 9
PHASE_PLANETS = [SUN_PLANET_NUMBER]
HARD_PLANETS = [JUPITER_PLANET_NUMBER, SATURN_PLANET_NUMBER]

NAME_PLANETS = ["S", "M", "M", "M", "J", "V", "S", "R", "K"]
NAME_PLANETS_DREK = ["Su", "Mo", "Ma", "Me", "Ju", "Ve", "Sa", "Ra", "Ke"]
DICT_NAME_PLANETS = {"Su": 0, "Mo": 1, "Ma": 2, "Me": 3, "Ju": 4, "Ve": 5, "Sa": 6, "Ra": 7, "Ke": 8}

MUHURTA_NAME = ['Раудра', 'Ахи', 'Маитра', 'Питра', 'Савитри', 'Вайра',
                'Вишва', 'Абхиджит', 'Раухина', 'Бала', 'Вахи', 'Ниритта',
                'Варуна', 'Арйама', 'Бхага', 'Гириша', 'Аджапада', 'Ахирбудхнйа',
                'Пуша', 'Ашви', 'Йама', 'Агни', 'Видхатри', 'Ратринатха',
                'Адитйа', 'Джива', 'Вишну', 'Тапас', 'Брахма', 'Вайу']

planets_hard = [MARS_PLANET_NUMBER, JUPITER_PLANET_NUMBER, SATURN_PLANET_NUMBER,
                KETY_PLANET_NUMBER, RAHY_PLANET_NUMBER, MERCURY_PLANET_NUMBER]

SPHUTA_DATA = {'P1':[], 'P2':[], 'NAME':[]}
for ns1, plane1 in enumerate(HARD_PLANETS):
    for ns2, plane2 in enumerate(HARD_PLANETS):
        if ns1 > ns2:
            SPHUTA_DATA['P1'].append(plane1)
            SPHUTA_DATA['P2'].append(plane2)
            SPHUTA_DATA['NAME'].append(NAME_PLANETS[plane1]+'-'+NAME_PLANETS[plane2])

SECONDS_IN_ZNAK = 108000
SECONDS_IN_ZODIAC = 1296000
SECONDS_IN_HALF_ZODIAC = SECONDS_IN_ZODIAC / 2
SECONDS_IN_HALF_DEGREE = 1800
SECONDS_HALF_ZNAK = 61200 # Размер аспекта
DEGREES_IN_HALF_ZNAK = SECONDS_HALF_ZNAK / 3600 # Размер аспекта
SECONDS_IN_DAY = 86400
SECONDS_OF_ASPECT = 72000
SECONDS_IN_TITHI = 43200
DAY_IN_MAHADAHA = 4320
ZNAKS_IN_ZODIAK = 12
DEGREES_IN_ZODIAK = 360
DEGREES_IN_HALF_ZODIAK = 180
SECONDS_IN_PADA = 12000
SECONDS_IN_HOUR = 3600
SECONDS_IN_NAKSHATRA = 48000
SECONDS_IN_NAVAMSHA = 12000
SECONDS_IN_DREKKANA = 36000
NAKSHATRAS_IN_ZODIAK = 27
DEGREES_IN_ZNAK = 30
GULIKA_DRUVANKA_CONST_DAY = [1.733, 2.2, 4.8, 2.333, 2., 1.4, 0.067]
GULIKA_DRUVANKA_CONST_NIGHT = [1.333, 0.6, 0.267, 4.333, 4.4, 4.2, 0.467]
CHAKRA_DAHES = [1.0, .9, .8, .9, .7, .5, .7, .5, .3, .7]
KENDRA = np.array([0, 3, 6, 9])
EKSATS_PLANETS_IN_ZNAKS = [0, 1, 9, 5, 3, 11, 6, 1, 7]
NATURE_PLANETS = [[0, -100], [50, -50], [0, -100], [0, 0], [100, 0], [100, 0], [0, -100], [0, -100], [0, -100]]

UPACHAYA = [2, 5, 9, 10]
APACHAYA = [0, 1, 3, 4, 6, 7, 8, 11]

PLANETS_RANGE = np.arange(NUMBER_OF_PLANETS)
ZODIAK_RANGE = np.arange(ZNAKS_IN_ZODIAK)
ASPECTS_RANGE = np.arange(NUMBER_OF_PLANETS * 7)
MAP_RANGE = np.arange(6)
DREKKANA_RANGE = np.arange(ZNAKS_IN_ZODIAK*3)

NUMBER_OF_ASPECTS = [1, 1, 3, 1, 3, 1, 3, 3, 3]

DRISHTI_PLANETS = [6, 10, 10,
                   6, 10, 10,
                   3, 6, 7,
                   6, 10, 10,
                   4, 6, 8,
                   6, 10, 10,
                   2, 6, 9,
                   0, 6, 10,
                   10, 10, 10]

DPLA = [6, 6, 6,
        6, 6, 6,
        3, 6, 7,
        6, 6, 6,
        4, 6, 8,
        6, 6, 6,
        2, 6, 9,
        5, 5, 9,
        5, 5, 9]

ASP = [[0, 6], [0, 6], [0, 3, 6, 7], [0, 6], [0, 4, 6, 8], [0, 6], [0, 2, 6, 9, 1, 5, 8], [0, 5, 7, 9, 5, 7, 9],
       [0, 5, 7, 9, 5, 7, 9]]
ASP_2 = [[0, 6], [0, 6], [0, 3, 6, 7], [0, 6], [0, 4, 6, 8], [0, 6], [0, 2, 6, 9], [0, 5, 7, 9], [0, 5, 7, 9]]
ASPECTS_FOR_YOGA_DICT = {'Su': [0, 6], 'Mo': [0, 6], 'Ma': [0, 3, 6, 7], 'Me': [0, 6], 'Ju': [0, 4, 6, 8],
                         'Ve': [0, 6], 'Sa': [0, 2, 6, 9], 'Ra': [0, 5, 7, 9], 'Ke': [0, 5, 7, 9]}
ASPECTS_FOR_YOGA = [[0, 6], [0, 6], [0, 3, 6, 7], [0, 6], [0, 4, 6, 8], [0, 6], [0, 2, 6, 9], [0, 5, 7, 9], [0, 5, 7, 9]]
PLANET_UPRAV = [[4], [3], [0, 7], [2, 5], [8, 11], [1, 6], [9, 10], [10], [7]]
WHO_UPRAVLAET_ZNAKOM_LI = [[MARS_PLANET_NUMBER], [VENUS_PLANET_NUMBER], [MERCURY_PLANET_NUMBER], [MOON_PLANET_NUMBER],
                           [SUN_PLANET_NUMBER],
                           [MERCURY_PLANET_NUMBER], [VENUS_PLANET_NUMBER], [MARS_PLANET_NUMBER, KETY_PLANET_NUMBER],
                           [JUPITER_PLANET_NUMBER],
                           [SATURN_PLANET_NUMBER],
                           [SATURN_PLANET_NUMBER, RAHY_PLANET_NUMBER], [JUPITER_PLANET_NUMBER]]

MINUTS_IN_HOUR = 60
SECONDS_IN_DEGREE = 3600
HOURS_IN_DAY = 24
RATION_SPEED = [1, 0, 1, 1, 1, 1, 1, 1, 1]

RATIO_TR = [.6, .7, .8, .9, 1, .7, 1, 1, 1]
SP_PLANET_MAX = [3656.84, 55379.88, 2879.89, 8000.85, 899.89, 4676.85, 480.85, 120.00, 120.00]
SP_PLANET_RETR = [0.00, 0.00, 1440.16, 4980.16, 540.16, 2280.16, 300.16, 960.15, 960.15]
SP_PLANET_MEDDLE = [3548, 47433, 1894, 3550, 299, 3556, 126, -191, -191]
SP_POWER_VALUE = 45
SP_POWER_RETR = 60

NAME_PLANET_TIME = ['SUN', 'MOON', 'MARS', 'MERCURY', 'JUPITER', 'VENUS', 'SATURN', 'RAHY', 'KETY']

TITHI_NAME = ['Пратипад', 'Двитйа', 'Тритйа', 'Чатуртхи', 'Панчами', 'Шаштхи', 'Саптами', 'Аштами',
              'Навами', 'Дашами', 'Экадаши', 'Двадаши', 'Трайодаши', 'Чатурдаши', 'Пурнима', 'Пратипад',
              'Двитйа', 'Тритйа', 'Чатуртхи', 'Панчами', 'Шаштхи', 'Саптами', 'Аштами', 'Навами',
              'Дашами', 'Экадаши', 'Двадаши', 'Трайодаши', 'Чатурдаши', 'Амавасйа']

LIGHTS_PLANET = np.array([1.667, 1.5, .833, .833, 1.167, 1.333, .833])
POINT_DEB_ZNAK = np.array([6.333, 7.1, 3.933, 11.5, 9.167, 5.9, 0.667])
RATIO_LIGHT_TR = np.array([3, 2, 0.25, 1.333, 1.2, 1, .5, .4])

NTRL, FRND, ENEM = 'в нейтральном', 'в дружественном', 'во вражеском'
EKST, SELF, DEBL = 'в экзальтации', 'в собственном', 'в дибилитации'

NAME_LIGHT_TR = ['в экзальтации', 'в мулатриконе', 'в собственном', 'большой друг',
                 FRND, NTRL, ENEM, 'большой враг', 'в дибилитации']
FIRE_SUN_ANGLE = [-1, 12, 17, 14, 11, 10, 16]

CLASS_LIGHT = [25, 30, 35, 40, 45, 50, 55, 60, 65, 999]
COLOR_CLASS = ['#FFFFFF', '#FF6565', '#FFA54B', '#FFEA2C', '#2CE2FF', '#20F7C5', '#2FEC36', '#38C323', '#188009']

NAME_BALA = ['в экзальтации', 'в мулатриконе', SELF, FRND,
             NTRL, ENEM, 'в дибилитации']

DICT_BALA = {'в экзальтации': (100, 0), 'в мулатриконе': (75, -12.5), SELF: (50, -25), FRND: (25, -50),
             NTRL: (12.5, -75), ENEM: (0, -100), 'в дибилитации': (0, -100)}

#                          Su    Mo    Ma    Bu    Ju    Ve    Sa    Ra    Ke
RELATION_PLANETS_START = [[FRND, FRND, FRND, NTRL, FRND, ENEM, ENEM, ENEM, ENEM],  # for Su
                          [FRND, FRND, NTRL, FRND, NTRL, NTRL, NTRL, ENEM, ENEM],  # Mo
                          [FRND, FRND, FRND, ENEM, FRND, NTRL, NTRL, ENEM, FRND],
                          [FRND, ENEM, NTRL, FRND, NTRL, FRND, NTRL, NTRL, NTRL],
                          [FRND, FRND, FRND, ENEM, FRND, ENEM, NTRL, FRND, NTRL],
                          [ENEM, ENEM, NTRL, FRND, NTRL, FRND, FRND, FRND, FRND],
                          [ENEM, ENEM, ENEM, FRND, NTRL, FRND, FRND, FRND, FRND],
                          [ENEM, ENEM, ENEM, NTRL, FRND, FRND, FRND, FRND, NTRL],
                          [ENEM, ENEM, FRND, NTRL, NTRL, FRND, FRND, NTRL, FRND]]

NUM_BAW = [12, 8, 6]

FORMAT_DATE = '%d.%m.%Y'
FORMAT_TIME = '%H:%M:%S'
FORMAT_COORDS = '%j.%M.%S'
#     экзальт   мулатр     собств      собств      дебилет     друг      друг       друг        друг        друг
#     враг      враг      враг        враг
RESULT_EKSALTATION = [
    [[0, 30], [120, 141], [141, 150], [141, 150], [180, 210], [12, 30], [90, 120], [210, 240], [240, 270], [330, 360],
     [30, 60], [30, 60], [270, 300], [300, 330]],
    [[30, 34], [34, 60], [90, 120], [90, 120], [210, 240], [60, 90], [120, 150], [150, 180], [150, 180], [150, 180],
     [-1, 0], [-1, 0], [-1, 0], [-1, 0]],
    [[270, 300], [0, 13], [13, 30], [210, 240], [90, 120], [120, 150], [90, 120], [240, 270], [330, 360], [330, 360],
     [60, 90], [150, 180], [150, 180], [150, 180]],
    [[150, 166], [166, 171], [171, 180], [60, 90], [330, 360], [30, 60], [120, 150], [180, 210], [180, 210], [180, 210],
     [90, 120], [90, 120], [90, 120], [90, 120]],
    [[90, 120], [240, 251], [251, 270], [330, 360], [270, 300], [120, 150], [120, 150], [0, 30], [210, 240], [210, 240],
     [60, 90], [150, 180], [30, 60], [180, 210]],
    [[330, 360], [180, 196], [196, 210], [30, 60], [150, 180], [60, 90], [150, 180], [270, 300], [300, 330], [300, 330],
     [90, 120], [120, 150], [120, 150], [120, 150]],
    [[180, 210], [300, 321], [270, 300], [321, 330], [0, 30], [60, 90], [150, 180], [30, 60], [30, 60], [180, 210],
     [90, 120], [120, 150], [120, 150], [210, 240]],
    [[30, 60], [60, 90], [300, 330], [300, 330], [210, 240], [240, 270], [330, 360], [180, 210], [270, 300], [270, 300],
     [90, 120], [120, 150], [0, 30], [0, 30]],
    [[210, 240], [120, 150], [60, 90], [60, 90], [30, 60], [0, 30], [180, 210], [300, 330], [270, 300], [270, 300],
     [90, 120], [90, 120], [90, 120], [90, 120]]]

SELF_DEBILITATION = [6, 2, 3, 11, 9, 5, 0, 7, 1]
SELF_ZNAKS = [[4], [3], [0, 7], [2, 5], [11, 8], [1, 6], [9, 10], [10], [4]]


AVASTHA_INTERVALS = np.arange(0, 11) * 10
AVASTHA_RESULTS = [25, 25, 37, 50, 75, 100, 55, 10, 5, 0, 0]

WEEKDAYS = ['понедельник', 'вторник', 'среда', 'четверг', 'пятница', 'суббота', 'воскресенье']
# номера позиций 0-экзальтация, 1-мулатрикона, 2-собственный, 3-друг, 4-нейтральный, 5-враг, 6-дибилитация
SCALA_BALA = [0, 1, 2, 2, 6, 3, 3, 3, 3, 3, 5, 5, 5, 5]
COLOR_BALA = {'в экзальтации': '#008000',
              'в мулатриконе': '#9ACD32',
              'в собственном': '#FFD700',
              'в дружественном': '#FF8C00',
              'большой друг': '#FF8C00',
              'в нейтральном': '#FF4500',
              'большой враг': '#8B0000',
              'во вражеском': '#8B0000',
              'в дибилитации': '#000000'}

GOOD_COLORS = ['red', 'green']

NAME_JOGA = ['алмазная', "лакшми", "раджа", "парвата", "гаджа-кешари", "амала", "кхала", "чамара"]
NAME_MONTH = ["JAR", "FEB", "MAR", "APR", "MAY", "JUN", "JUL", "AUG", "SEP", "OKT", "NOV", "DEC"]

NAME_ZNAKS = ['овен', 'телец', 'близнецы', 'рак', 'лев', 'дева',
              'весы', 'скорпион', 'стрелец', 'козерог', 'водолей', 'рыбы']

LIST_AVASTH_NAME = ['Нидра', 'Шайана', 'Упавешана', 'Нетрапани', 'Пракашана', 'Гамана',
                    'Агамана', 'Сабха', 'Агама', 'Бходжана', 'Нритья-Липса', 'Каутука']

ekzaltt, selft, drugt, neitralt, vragt = 'экзальтация', 'собственный', 'друг', 'нейтральный', 'враг'
RELAT_GRAH_T = [ekzaltt, neitralt, selft, neitralt, drugt, neitralt, vragt, vragt, drugt,
                vragt, ekzaltt, neitralt, drugt, vragt, selft, drugt, drugt, drugt,
                neitralt, drugt, vragt, selft, vragt, drugt, drugt, neitralt, neitralt,
                drugt, selft, drugt, vragt, ekzaltt, vragt, vragt, vragt, vragt,
                selft, drugt, drugt, drugt, drugt, vragt, vragt, vragt, vragt,
                neitralt, drugt, vragt, ekzaltt, vragt, drugt, drugt, neitralt, neitralt,
                vragt, neitralt, neitralt, drugt, vragt, selft, ekzaltt, drugt, drugt,
                drugt, neitralt, selft, neitralt, drugt, neitralt, vragt, vragt, selft,
                drugt, neitralt, drugt, neitralt, selft, neitralt, neitralt, drugt, neitralt,
                vragt, neitralt, ekzaltt, neitralt, neitralt, drugt, selft, drugt, drugt,
                vragt, neitralt, neitralt, neitralt, neitralt, drugt, selft, drugt, drugt,
                drugt, neitralt, drugt, neitralt, selft, ekzaltt, neitralt, selft, neitralt]


VARGA_SHAD, ALL_VARGAS, VARGA_SHODASHA, VARGA_SAPTA, \
EVEN_ODD, BINDY_VARGA_CHARITY, ALL_VARGAS_PARTS = "VARGA_SHAD", "ALL_VARGAS", "VARGA_SHODASHA", \
                                                  "VARGA_SAPTA", "EVEN_ODD", "BINDY_VARGA_CHARITY", "ALL_VARGAS_PARTS"

PERCENT_ANGLE_ZODIAK = 0.0000015432  # угловой процент зодиака для 648000 угловых секунд (180 градусов)

MOON_DAY_IN_DEGREES = 12  # разница положений между Солнцем и луной в 12 градусов дает одни лунные сутки
DAYS_IN_MOON_MONTH = 30

MIN_SPEED_PLANETS = np.array([3428, 42124, -1441, -4981, -541, -2281, -301, -901, -901])
MAX_SPEED_PLANETS = np.array([3671, 55379, 2880, 8385, 900, 4676, 481, 720, 480])

MAXIMUS_SPEED_PLANETS = np.array([13771, 86379, 12980, 18485, 11000, 14776, 1581, 1720, 1580])

"""
    данные о планетах, каким знаком управляют, знаки экзальтации
"""
WHO_UPRAVLAET_ZNAKOM = [MARS_PLANET_NUMBER, VENUS_PLANET_NUMBER, MERCURY_PLANET_NUMBER, MOON_PLANET_NUMBER,
                        SUN_PLANET_NUMBER,
                        MERCURY_PLANET_NUMBER, VENUS_PLANET_NUMBER, MARS_PLANET_NUMBER, JUPITER_PLANET_NUMBER,
                        SATURN_PLANET_NUMBER,
                        SATURN_PLANET_NUMBER, JUPITER_PLANET_NUMBER]
"""
    данные о силе при взаимоотношениях планет в варгах
"""
RAPPORT_PLANETS_SHODAHA = [20, 18, 10, 15, 18, 10, 10, 5, 5,
                           18, 20, 7, 10, 15, 7, 7, 5, 5,
                           10, 10, 20, 10, 10, 15, 15, 5, 5,
                           18, 5, 15, 20, 15, 10, 15, 5, 5,
                           18, 18, 10, 10, 20, 10, 7, 5, 5,
                           10, 5, 15, 10, 15, 20, 18, 5, 5,
                           10, 5, 10, 18, 7, 18, 20, 5, 5]

RAPPORT_PLANETS_SAPTA = [30, 20, 10, 15, 20, 10, 10, 2, 2,
                         20, 30, 4, 10, 15, 4, 4, 2, 2,
                         10, 10, 30, 10, 10, 15, 15, 2, 2,
                         20, 2, 15, 30, 15, 10, 15, 2, 2,
                         20, 20, 10, 10, 30, 10, 4, 2, 2,
                         10, 2, 15, 10, 15, 30, 20, 2, 2,
                         10, 2, 10, 20, 4, 20, 30, 2, 2]

RAPPORT_EVEN_ODD = [15, 0, 15, 0, 15, 0, 15, 0, 15, 0, 15, 0,
                    0, 15, 0, 15, 0, 15, 0, 15, 0, 15, 0, 15,
                    15, 0, 15, 0, 15, 0, 15, 0, 15, 0, 15, 0,
                    15, 0, 15, 0, 15, 0, 15, 0, 15, 0, 15, 0,
                    15, 0, 15, 0, 15, 0, 15, 0, 15, 0, 15, 0,
                    0, 15, 0, 15, 0, 15, 0, 15, 0, 15, 0, 15,
                    15, 0, 15, 0, 15, 0, 15, 0, 15, 0, 15, 0,
                    15, 0, 15, 0, 15, 0, 15, 0, 15, 0, 15, 0,
                    15, 0, 15, 0, 15, 0, 15, 0, 15, 0, 15, 0]

ARRAY_BALA_PLANT = [36000, 39540, 111600, 122340, 975600, 1076340, 594000, 597540, 342000, 345540, 1285200, 1288740,
                    720000, 723540,
                    108000, 215940, 756000, 863940,
                    432000, 503940, 122400, 215940, 0, 46740, 597600, 615540, 864000, 885540, 648000, 723540, 1080000,
                    1155540, 216000,
                    323940, 540000, 647940,
                    504000, 539940, 324000, 431940, 46800, 107940, 615600, 323940, 885600, 971940, 723600, 755940,
                    1155600, 1187940,
                    1083540, 1187940, 756000, 863940,
                    504000, 539940, 324000, 431940, 756000, 863940, 615600, 323940, 1188000, 1295940, 108000, 215940,
                    972000, 1079940,
                    1083540, 1187940, 756000, 863940,
                    648000, 755940, 770400, 863940, 324000, 431940, 1188000, 1295940, 972000, 1079940, 540000, 647940,
                    0, 107940,
                    756000, 863940, 108000, 215940,
                    684000, 687540, 759600, 770340, 327600, 428340, 1242000, 1245540, 990000, 993540, 615600, 619140,
                    72000, 75540,
                    756000, 863940, 108000, 215940]

"""
    Разрушительные градусы по планетам
"""
dict_break_angles = {'Su': [20, 72, 96, 128, 174, 196, 227, 262, 272, 353],
                     'Mo': [8, 82, 112, 141, 151, 185, 233, 258, 290, 320, 340],
                     'Ma': [19, 58, 85, 113, 178, 194, 242, 285, 311, 336],
                     'Me': [15, 44, 73, 102, 128, 168, 201, 220, 261, 292, 307, 335],
                     'Ju': [19, 59, 72, 117, 126, 154, 193, 220, 257, 281, 315, 358],
                     'Ve': [45, 71, 107, 130, 163, 183, 216, 267, 282, 329, 349],
                     'Sa': [10, 67, 99, 132, 166, 183, 228, 268, 284, 313, 345],
                     'Ra': [14, 72, 101, 144, 173, 202, 231, 250, 290, 318, 338],
                     'Ke': [8, 48, 80, 100, 141, 172, 203, 234, 251, 282, 313, 344]}

"""
    контуры тела и данные по точкам дреккан
"""
COUNTER_MAN_OX_1 = [30, 27, 23, 23, 27, 23, 18, 14, 10, 10, 11, 15, 17, 17, 19]
COUNTER_MAN_OX_1_0 = [30, 33, 37, 37, 33, 37, 42, 46, 50, 50, 49, 45, 43, 43, 41]
COUNTER_MAN_OX_2 = [18, 18, 20, 20, 19, 19, 20, 20, 21, 18, 18, 19, 24, 27, 28, 28, 29, 29, 30, 30, 31]
COUNTER_MAN_OX_2_0 = [42, 42, 40, 40, 41, 41, 40, 40, 39, 42, 42, 41, 36, 33, 32, 32, 31, 31, 30, 30, 30]
COUNTER_MAN_OY_1 = [100, 100, 96, 92, 88, 87, 84, 82, 77, 63, 53, 41, 40, 41, 42]
COUNTER_MAN_OY_2 = [70, 57, 50, 43, 42, 21, 20, 16, 7, 4, 1, 0, 0, 2, 3, 6, 7, 23, 24, 34, 40]

DREKKANA_OX = [30, 33, 39, 30, 35, 30, 30, 30, 25, 30, 22, 28,
               30, 15, 47, 39, 35, 34, 30, 26, 26, 21, 14, 47,
               39, 30, 30, 38, 31, 36, 38, 26, 21, 24, 30, 30]

DREKKANA_OY = [98, 95, 95, 93, 91, 88, 95, 88, 91, 93, 95, 95,
               87, 78, 57, 60, 70, 58, 58, 58, 70, 60, 57, 78,
               48, 43, 43, 33, 24, 7, 3, 6, 24, 33, 43, 43]

"""
    counter coords
"""
COUNTER_KVAD_X = [-5, -5, 103.5, 103.5, -5]
COUNTER_KVAD_Y = [-4, 104, 104, -4, -4]

VARGA_TXT = ['D60', 'D45', 'D40', 'D27', 'D24', 'D20', 'D16', 'D12', 'D11', 'D10', 'D9', 'D8',
             'D7', 'D6', 'D5', 'D4', 'D3', 'D1', 'D1']

VARGA_MAPS = [' D1', ' D3', ' D4', ' D5', ' D6', ' D7', ' D8', ' D9', 'D10', 'D11', 'D12', 'D16',
              'D20', 'D24', 'D27', 'D40', 'F45', 'D60']

"""
    natal map
"""
BRILLANT_MAP_X = [50, 50, 50, 50, 100, 105, 0, -5, -5, 105, -5, 105]
BRILLANT_MAP_Y = [100, 105, 0, -5, 50, 50, 50, 50, -5, 105, 105, -5]

COORDS_BHAVAS_X = [50, 25, 25, 0, 25, 25, 50, 75, 75, 100, 75, 75, 50]
COORDS_BHAVAS_Y = [100, 75, 75, 50, 25, 25, 0, 25, 25, 50, 75, 75, 100]

COORDS_BHAVAS = [[[50, 50], [25, 75], [50, 100], [75, 75]],
                 [[50, 100],[25, 75], [0, 100]],
                 [[0, 50], [25, 75], [0, 100]],
                 [[50, 50], [25, 75], [0, 50], [25, 25]],
                 [[0, 0], [0, 50], [25, 25]],
                 [[0, 0], [25, 25], [50, 0]],
                 [[50, 50], [75, 25], [50, 0], [25, 25]],
                 [[50, 0], [75, 25], [100, 0]],
                 [[100, 0], [75, 25], [100, 50]],
                 [[75, 25], [50, 50], [75, 75], [100, 50]],
                 [[75, 75], [100, 50], [100, 100]],
                 [[100, 100], [75, 75], [50, 100]]]

ANGLES = [135, 45, 135, 45, 135, 225,
          315, 225, 315, 225, 315, 45]

next_range = [0, 1, 1, 0, 1, 1,
              0, 1, 1, 0, 1, 1]

HOUSE_OX = [46, 21, 14, 37, 14, 21, 46, 71, 80, 55, 80, 71]
HOUSE_OY = [56, 80, 73, 48, 23, 16, 40, 16, 23, 48, 73, 80]
DELTA_P = [1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 0, 0, 0]

DELTA_OX_TEXT = [-2, -2, -6, 3, -6, -2, -2, -2, 3, -6, 3, -2]
DELTA_OY_TEXT = [-6, 2, -2, -2, -2, -6, 2, -6, -2, -2, -2, 2]

"""
    by window
"""
COLOR_PLANET = ["gold",
                "gray",
                "red",
                "limegreen",
                "darkorange",
                "hotpink",
                '#8500ff',
                "blue",
                "darkred",
                '#ffffff',
                "gold",
                "gray",
                "red",
                "green",
                "darkorange",
                "hotpink",
                '#8500ff',
                "blue",
                "darkred",
                '#ffffff',
                ]

COLOR_PLANET_DICT = {'Su': "gold",
                     'Mo': "gray",
                     'Ma': "red",
                     'Me': "limegreen",
                     'Ju': "darkorange",
                     'Ve': "hotpink",
                     'Sa': '#8500ff',
                     'Ra': "blue",
                     'Ke': "darkred"}

JOGA_COLOR = ["gold", "green", "hotpink", "darkred", "darkorange", "blue", "red", "gray", '#8500ff']

COLOR_PLANET_ASPECT = ['#ffffcc', '#9bb0b0', '#f9b8b8', '#84e184', '#ffd9b3', '#ffccf2', '#e6ccff', '#a64dff',
                       "darkred"]

COL_SAJU = ['#ffffff', '#ffffff', '#FFC0CB', '#FFA500', '#00CED1', '#00CED1', '#00FF00', '#00FF00', '#00FF00',
            '#00FF00']
COLORS_OBMEN = ['springgreen', 'limegreen', 'forestgreen', 'forestgreen', 'forestgreen', 'forestgreen', 'forestgreen']
COLORS_SARVA = ['red', 'orangered', 'orange', 'white', 'springgreen', 'limegreen', 'forestgreen']
COLOR_INDEX_ASHTAKA = [0, 0, 0, 0, 1, 2, 2, 2, 2]
COLOR_INDEX_SARVA = [0,0,0,0,0,0,0,0,0,0,
                     0,0,0,0,0,0,0,0,0,0,
                     0,0,0,1,2,3,3,3,3,4,
                     5,6,6,6,6,6,6,6,6,6,
                     6,6,6,6,6,6,6,6,6,6,
                     6,6,6,6,6,6,6,6,6,6]

COLOR_ASHTAKA = [['#333300', '#ffffff', 'gold'],
              ['#141f1f', '#ffffff', '#669999'],
              ['#4d0000', '#ffffff', '#ff0000'],
              ['#00260d', '#ffffff', '#009900'],
              ['#402600', '#ffffff', '#ff9900'],
              ['#4d004d', '#ffffff', '#ff00ff'],
              ['#00004d', '#ffffff', '#0066ff']]

COLOR_PERIOD = ["red",
                "green"]

COLOR_ZNAK = ['#d41111', '#ff00bf', '#196719', "gray", "gold", '#32cd32', '#ff66d9', '#f25a5a', '#ffa64d', '#a64dff',
              '#7300e6', '#e67300']

COLOR_CLASS_JU = ['#FFFFFF','#fff5e6','#ffebcc','#ffe0b3','#ffd699','#ffcc80','#ffc266','#ffb84d','#ffad33','#ffa31a','#ffa31a']
COLOR_CLASS_MA = ['#ffffff','#ffe6e6','#ffcccc','#ffb3b3','#ff9999','#ff8080','#ff6666','#ff4d4d','#ff3333','#ff1a1a','#ff1a1a',
                  '#ff0000','#ff0000','#ff0000','#ff0000','#ff0000','#ff0000','#ff0000','#ff0000','#ff0000','#ff0000','#ff0000','#ff0000']
COLOR_CLASS_MO = ['#ffffff','#f0f5f5','#e0ebeb','#d1e0e0','#c2d6d6','#b3cccc','#a3c2c2','#94b8b8','#85adad','#75a3a3','#75a3a3']
COLOR_CLASS_NY = {0: get_color_scheme(15, base_color='green'),
                  1: get_color_scheme(15, base_color='red')}

COLOR_CLASS_BRN = {0: get_color_scheme(22, base_color='green'),
                   1: get_color_scheme(22, base_color='red')}

xmax_color = len(COLOR_CLASS_BRN[0]) - 1

LEVEL_COLOR = [COLOR_PLANET[MERCURY_PLANET_NUMBER], COLOR_PLANET[JUPITER_PLANET_NUMBER],
               COLOR_PLANET[MARS_PLANET_NUMBER]]
LEVEL_NUMB = [0, 30, 60]

FIRE, WATER, OXUGEN, GROWND = "red", "blue", "orange", "black"
COLOR_ELEMENTS_PLANETS = [FIRE, WATER, FIRE, GROWND, FIRE, WATER, OXUGEN, OXUGEN, FIRE]
COLOR_ELEMENTS_ZNAK = [FIRE, GROWND, OXUGEN, WATER, FIRE, GROWND, OXUGEN, WATER, FIRE, GROWND, OXUGEN, WATER]

NAME_GRAPHICS = ["Экономика", "Гороскоп", "План на детей", "no graphics", "output_data"]
DASHA_YEARTABLE, HOROSCOP, PLAN_BABY, NO_GRAPHICS, OUTPUT_DATA = 0, 1, 2, 3, 4

DAYS = (np.arange(30)+1).tolist()
MONTH = (np.arange(12)+1).tolist()
YEARS = np.arange(2020, 2040).tolist()

DAYS_OUTPUT = ["surya siddhanta", "lahiri"]

TEXT_LABL = ["", "down", "up"]

NAME_NAKSHATRAS = ["Ашвини", "Бхарани", "Криттика", "Рохини", "Мригашира", "Ардра", "Пурнавасу",
                   "Пушья", "Ашлеша", "Магха", "Пурва-Пхалгуни", "Уттара-Пхалгуни",
                   "Хаста", "Читра", "Свати", "Вишакха", "Анурадха", "Джиештха",
                   "Мула", "Пурва-Шадха", "Уттара-Шадха", "Шравана", "Дхаништха",
                   "Шатабхиша", "Пурва-Бхадрапада", "Уттара-Бхадрапада", "Ревати"]

"""
    данные для словаря для кала чакра даш
"""

NAKSHATRA_GR = [0, 1, 0, 2, 3, 2, 0, 1, 0, 2, 3, 2, 0, 1, 0, 2, 3, 2, 0, 1, 0, 2, 3, 2, 0, 1, 0]
DAYS_IN_GROUP = [36000, 30600, 29880, 30960, 36000, 30600, 29880, 30960, 30960, 29880, 30600, 36000, 30960, 29880,
                 30600, 36000]

nak_x = [1, 0.973054993740227, 0.893672041685587, 0.766129092116142, 0.597299436180971,
         0.396281306152089, 0.173907571573409, -0.0578380442146052, -0.286466767075789,
         -0.499657792272824, -0.685922252788789, -0.83522235451453, -0.939512313098879,
         -0.993171941368062, -0.993309521282859, -0.939917638659938, -0.835873582722292,
         -0.686784288946983, -0.500684181242094, -0.287602196741731, -0.0590213262583062,
         0.0862537096441022, 0.172740204236099, 0.39519276296159, 0.59634837874345,
         0.765366772928812, 0.893139542138998, 0.972781010241611]
nak_y = [0, 0.230573153591667, 0.448720717049608, 0.642686715447966, 0.802018318704688,
         0.918129144725509, 0.984761979642512, 0.998325979147808, 0.95809017913824,
         0.866222887380059, 0.72767483337625, 0.549912373491636, 0.342515128914905,
         0.116659739752815, -0.11548244424508, -0.341401277876821, -0.54892199236959,
         -0.726861293821309, -0.865630031049024, -0.957749955066212, -0.998256722014288,
         -0.996273204283158, -0.984967421715293, -0.918598214728716, -0.802725738449976,
         -0.643594362076406, -0.449779677473029, -0.231726360419593]
nak_xl = [0.993240905757568, 0.939715140911367, 0.835548115356647, 0.686353391404674,
          0.50017107459707, 0.287034532317516, 0.0584296954978283, -0.17332391834375,
          -0.395737104055847, -0.596824012275926, -0.765748067002489, -0.893405948811471,
          -0.972918172853966, -0.999999824380866, -0.973191472852339, -0.893937820667884,
          -0.76650984813594, -0.597774650291597, -0.396825369059172, -0.174491163720074,
          0.0136522621519351, 0.129620280190308, 0.285898901215972, 0.499144334449641,
          0.68549087325076, 0.834896300310361, 0.939309155293714, 0.993102628138565, ]

nak_yl = [0.116071112383256, 0.341958263450277, 0.5494172794188, 0.727268191320989,
          0.865926611287823, 0.957920235331348, 0.998291525900141, 0.984864873640018,
          0.918363841009375, 0.802372169489237, 0.64314065170999, 0.449250276158263,
          0.231149797599957, 0.000592653555099454, -0.229996428597262, -0.448191000333067,
          -0.642232553449775, -0.801664186220614, -0.917894125959553, -0.984658739758915,
          -0.999906803526276, -0.99156370595307, -0.958259786427199, -0.86651885922167,
          -0.728081219844264, -0.550407274414202, -0.343071874075112, -0.117248326147011, ]

nak_clrr = ['red', 'blue', 'green', 'orange']
nak_ccc = [1, 0, -1, 0, 1, 0, 1, 1, -1, -1, 0, 0, 1, -1, 1, -1, 1, -1, -1, 1, 1, 1, -1, -1, 0, 0, 1, 2]
nak_z = np.concatenate([np.arange(21), [27, 21, 22, 23, 24, 25, 26]])

nak_nam_pl = ['Su', 'Mo', 'Ma', 'Me', 'Ju', 'Ve', 'Sa', 'Ra', 'Ke']
nak_rr = np.linspace(.45, .95, 9)

HIGH_LABEL = 20
LONG_LABEL = 85
LONG_BUTTON = 25
HIGH_BUTTON = 16
DAYS_IN_YEAR = 261
DAYS_IN_MONTH = 21.75
ROTATE_LABEL = 315
MIDDLE_DAY_IN_YEAR = 1.0139

BINDY_POLINTS = [
    [[1, 1, 0, 1, 0, 0, 1, 1, 1, 1, 1, 0],  # Благотворные дома для Солнца от себя
     [0, 0, 1, 0, 0, 1, 0, 0, 0, 1, 1, 0],  # Благотворные дома для Солнца от Луны
     [1, 1, 0, 1, 0, 0, 1, 1, 1, 1, 1, 0],  # Благотворные дома для Солнца от Марса
     [0, 0, 1, 0, 1, 1, 0, 0, 1, 1, 1, 1],  # Благотворные дома для Солнца от Меркурия
     [0, 0, 0, 0, 1, 1, 0, 0, 1, 0, 1, 0],  # Благотворные дома для Солнца от Юпитера
     [0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 1],  # Благотворные дома для Солнца от Венеры
     [1, 1, 0, 1, 0, 0, 1, 1, 1, 1, 1, 0],  # Благотворные дома для Солнца от Сатурна
     [0, 0, 1, 1, 0, 1, 0, 0, 0, 1, 1, 1]],  # Благотворные дома для Солнца от Лагны

    [[0, 0, 1, 0, 0, 1, 1, 1, 0, 1, 1, 0],  # Благотворные дома для Луны от себя
     [1, 0, 1, 0, 0, 1, 1, 0, 1, 1, 1, 0],
     [0, 1, 1, 0, 1, 1, 0, 0, 0, 1, 1, 0],
     [1, 0, 1, 1, 1, 0, 1, 1, 0, 1, 1, 0],
     [1, 1, 0, 1, 0, 0, 1, 1, 0, 1, 1, 0],
     [0, 0, 1, 1, 1, 0, 1, 0, 1, 1, 1, 0],
     [0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 1, 0],
     [0, 0, 1, 0, 0, 1, 0, 0, 0, 1, 1, 0]],

    [[0, 0, 1, 0, 1, 1, 0, 0, 0, 1, 1, 0],  # Благотворные дома для Марса от себя
     [0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 1, 0],
     [1, 1, 0, 1, 0, 0, 1, 1, 0, 1, 1, 0],
     [0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 1, 0],
     [0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 1],
     [0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 1, 1],
     [1, 0, 0, 1, 0, 0, 1, 1, 1, 1, 1, 0],
     [1, 0, 1, 0, 0, 1, 0, 0, 0, 1, 1, 0]],

    [[0, 0, 0, 0, 1, 1, 0, 0, 1, 0, 1, 1],  # Благотворные дома для Меркурия от себя
     [0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 1, 0],
     [1, 1, 0, 1, 0, 0, 1, 1, 1, 1, 1, 0],
     [1, 0, 1, 0, 1, 1, 0, 0, 1, 1, 1, 1],
     [0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 1, 1],
     [1, 1, 1, 1, 1, 0, 0, 1, 1, 0, 1, 0],
     [1, 1, 0, 1, 0, 0, 1, 1, 1, 1, 1, 0],
     [1, 1, 0, 1, 0, 1, 0, 1, 0, 1, 1, 0]],

    [[1, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 0],  # Благотворные дома для Юпитера от себя
     [0, 1, 0, 0, 1, 0, 1, 0, 1, 0, 1, 0],
     [1, 1, 0, 1, 0, 0, 1, 1, 0, 1, 1, 0],
     [1, 1, 0, 1, 1, 1, 0, 0, 1, 1, 1, 0],
     [1, 1, 1, 1, 0, 0, 1, 1, 0, 1, 1, 0],
     [0, 1, 0, 0, 1, 1, 0, 0, 1, 1, 1, 0],
     [0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1],
     [1, 1, 0, 1, 1, 1, 1, 0, 1, 1, 1, 0]],

    [[0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 1],  # Благотворные дома для Венеры от себя
     [1, 1, 1, 1, 1, 0, 0, 1, 1, 0, 1, 1],
     [0, 0, 1, 1, 0, 1, 0, 0, 1, 0, 1, 1],
     [0, 0, 1, 0, 1, 1, 0, 0, 1, 0, 1, 0],
     [0, 0, 0, 0, 1, 0, 0, 1, 1, 1, 1, 0],
     [1, 1, 1, 1, 1, 0, 0, 1, 1, 1, 1, 0],
     [0, 0, 1, 1, 1, 0, 0, 1, 1, 1, 1, 0],
     [1, 1, 1, 1, 1, 0, 0, 1, 1, 0, 1, 0]],

    [[1, 1, 0, 1, 0, 0, 1, 1, 0, 1, 1, 0],  # Благотворные дома для Сатурна от себя
     [0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 1, 0],
     [0, 0, 1, 0, 1, 1, 0, 0, 0, 1, 1, 1],
     [0, 0, 0, 0, 0, 1, 0, 1, 1, 1, 1, 1],
     [0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 1, 1],
     [0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 1],
     [0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 1, 0],
     [1, 0, 1, 1, 0, 1, 0, 0, 0, 1, 1, 0]],

    [[0, 0, 1, 1, 0, 1, 0, 0, 0, 1, 1, 1],  # Благотворные дома для Лагны от себя
     [0, 0, 1, 0, 0, 1, 0, 0, 0, 1, 1, 1],
     [1, 0, 1, 0, 0, 1, 0, 0, 0, 1, 1, 0],
     [1, 1, 0, 1, 0, 1, 0, 1, 0, 1, 1, 0],
     [1, 1, 0, 1, 1, 1, 1, 0, 1, 1, 1, 0],
     [1, 1, 1, 1, 1, 0, 0, 1, 1, 0, 0, 0],
     [1, 0, 1, 1, 0, 1, 0, 0, 0, 1, 1, 0],
     [0, 0, 1, 0, 0, 1, 0, 0, 0, 1, 1, 0]]]
