etdata = {
    0:
        ['кардинальные изменения в жизни',
         'успех в исцелении от фобий',
         'освобождение от различных изъянов',
         'обретение стойкости',
         'развитие силы воли'],

    1:
        ['для приготовления лекарственных средств',
         'занятия духовной практикой',
         'изучение мистический и тайных текстов',
         'для целенаправленной концентрации энергии'],

    2:
        ['для поиска помощи и покровительства',
         'обретение дружбы и партнерских отношений'],

    3:
        ['поминание предков',
         'продолжения родового или отцовского дела',
         'взаимодействие с отцом и старшими'],

    4:
        ['определение задач и целей, планирование',
         'обретение знаний',
         'обретение богатства'],

    5:
        ['обуздание внутренних врагов',
         'профилактика заболеваний'],

    6:
        ['общественная и публичная деятельность',
         'для начинаний связанных с коммуникациями, рекламой',
         'для начинаний связанных с обретением',
         'для начинаний связанных с восстановлением целостного состояния'],

    7:
        ['дарует успех во всех начинаниях'],

    8:
        ['для различных творческих начинаний',
         'для зачатия детей'],

    9:
        ['для выполнения процедур омоложения',
         'для педагогической деятельности',
         'для обретения авторитета',
         'для обретения социального положения'],

    10:
        ['для успешного участия в конкурсах',
         'для продвижения в карьере',
         'для расширения направлений поля деятельности',
         'для вступления в должность',
         'для использования транспортных средств'],

    11:
        ['деятельность, связанная с освобождением от всех ненужных вещей',
         'деятельность, связанная с наказанием преступников',
         'деятельность, связанная с разрушением старых строений'],

    12:
        ['для духовной практики',
         'для очищения',
         'для омовения',
         'для поиска помощи и покровительства',
         'для поиска необходимых знаний'],

    13:
        ['для создания, приобретения и установления Йантр (механизмов, изображений, программ)',
         'для обмена дарами',
         'для посещения других и приема гостей',
         'подготовка свадебной церемонии',
         'проведение свадебной церемонии'],

    14:
        ['проведение свадебной церемонии',
         'для обретения взаимопонимания',
         'для распределения даров'],

    15:
        ['для самосовершенствования',
         'для анализа выполненных задач',
         'для принятия решений'],

    16:
        ['для начала поездок, путешествий',
         'для начала духовных поисков и практики',
         'для нового шага'],

    17:
        ['для научных исследований',
         'для помещения ценных предметов в тайное место',
         'для скрытых действий',
         'применение тайных знаний для положительного решения вопроса'],

    18:
        ['для определения правильного направления движения',
         'начинания связанные с обретением богатств и даров от передвижений',
         'для поездок и путешествий'],

    19:
        ['начинания связанные с управлением и владением транспортными средствами',
         'обретение знаний',
         'занятия оздоровительными практиками'],

    20:
        ['для отстаивания законных прав',
         'для проведения ритуальных церемоний',
         'для починки транспортных средств',
         'для ухода за ездовыми животными'],

    21:
        ['для различных действий связанных с огнем',
         'проведения огненных жертвоприношений',
         'для очищения',
         'для кремации',
         'для изменения состояния сознания',
         'для приготовления лекарственных средств',
         'для начала лечения'],

    22:
        ['для начинаний связанных с дарением',
         'для распределения доходов',
         'для упорядочивания различных жизненных процессов',
         'для распоряжения имуществом',
         'для раздачи пищи',
         'для благотворительной помощи',
         'для выполнения наблюдений за небосводом и движением планет',
         'для осуществления астро-расчетов, составления и начертания Чакр'],

    23:
        ['для изменения уровня сознания',
         'для отказа от опьяняющих напитков',
         'для успокоения ума',
         'для отдыха',
         'для реализации репродуктивных функций'],

    24:
        ['для получения благословений перед отправлением в долгую дорогу',
         'для посещения матери',
         'для возвращения на родину',
         'для пребывания в защищенном и дружественном доме'],

    25:
        ['для духовного самосознания',
         'мысленного обращения к учителю',
         'для начала служения',
         'для ожидания с просьбой принять на обучение, перед вратами Ашрама или Храма'],

    26:
        ['для всех действий связанных с сохранением и поддержанием жизненных процессов',
         'для отдыха',
         'для восстановления',
         'для начала краткосрочных поездок и путешествий'],

    27:
        ['для начала совершения аскез',
         'для подготовки к совершению ритуалов, церемоний, обрядов',
         'для лечения'],

    28:
        ['для творческой деятельности',
         'для медитативной практики',
         'для постижения Святых Имен и Священных слогов'],

    29:
        ['для очистительных действий',
         'для выполнения дыхательных упражнений',
         'для правильного движения праны',
         'для улучшения подвижности семени']}
